## Plan for org_account/aft
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 25 to change, 5 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                                                     NAME                                                                      |
|----------|-----------------------------------------------------------------------------------------------------------------------------------------------|
| add      | `module.account_factory_for_terraform.module.aft_feature_options.aws_s3_bucket_policy.aft_access_logs`                                        |
| delete   | `module.account_factory_for_terraform.module.aft_backend.aws_s3_bucket_acl.primary-backend-bucket-acl`                                        |
|          | `module.account_factory_for_terraform.module.aft_backend.aws_s3_bucket_acl.secondary-backend-bucket-acl`                                      |
|          | `module.account_factory_for_terraform.module.aft_customizations.aws_s3_bucket_acl.aft-codepipeline-customizations-bucket-acl`                 |
|          | `module.account_factory_for_terraform.module.aft_feature_options.aws_s3_bucket_acl.aft_access_logs_acl`                                       |
| update   | `module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.account_metadata_ssm`                     |
|          | `module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.create_role`                              |
|          | `module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.persist_metadata`                         |
|          | `module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.tag_account`                              |
|          | `module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_account_request_action_trigger`            |
|          | `module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_account_request_audit_trigger`             |
|          | `module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_account_request_processor`                 |
|          | `module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_cleanup_resources`                         |
|          | `module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_controltower_event_logger`                 |
|          | `module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_invoke_aft_account_provisioning_framework` |
|          | `module.account_factory_for_terraform.module.aft_code_repositories.aws_codebuild_project.account_provisioning_customizations_pipeline`        |
|          | `module.account_factory_for_terraform.module.aft_code_repositories.aws_codebuild_project.account_request`                                     |
|          | `module.account_factory_for_terraform.module.aft_customizations.aws_codebuild_project.aft_account_customizations_terraform`                   |
|          | `module.account_factory_for_terraform.module.aft_customizations.aws_codebuild_project.aft_create_pipeline`                                    |
|          | `module.account_factory_for_terraform.module.aft_customizations.aws_codebuild_project.aft_global_customizations_terraform`                    |
|          | `module.account_factory_for_terraform.module.aft_customizations.aws_lambda_function.aft_customizations_execute_pipeline`                      |
|          | `module.account_factory_for_terraform.module.aft_customizations.aws_lambda_function.aft_customizations_get_pipeline_executions`               |
|          | `module.account_factory_for_terraform.module.aft_customizations.aws_lambda_function.aft_customizations_identify_targets`                      |
|          | `module.account_factory_for_terraform.module.aft_feature_options.aws_lambda_function.aft_delete_default_vpc`                                  |
|          | `module.account_factory_for_terraform.module.aft_feature_options.aws_lambda_function.aft_enable_cloudtrail`                                   |
|          | `module.account_factory_for_terraform.module.aft_feature_options.aws_lambda_function.aft_enroll_support`                                      |
|          | `module.account_factory_for_terraform.module.aft_lambda_layer.aws_codebuild_project.codebuild`                                                |
|          | `module.account_factory_for_terraform.module.aft_lambda_layer.aws_lambda_function.codebuild_invoker`                                          |
|          | `module.account_factory_for_terraform.module.aft_ssm_parameters.aws_ssm_parameter.aft_framework_repo_git_ref`                                 |
|          | `module.account_factory_for_terraform.module.aft_ssm_parameters.aws_ssm_parameter.aft_version`                                                |
| recreate | `module.account_factory_for_terraform.module.aft_lambda_layer.aws_lambda_layer_version.layer_version`                                         |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/cds-aws-lz/actions/runs/4863095094).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.account_metadata_ssm will be updated in-place
  ~ resource "aws_lambda_function" "account_metadata_ssm" {
        id                             = "aft-account-provisioning-framework-account-metadata-ssm"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-9-1:1",
        ] -> (known after apply)
      ~ runtime                        = "python3.8" -> "python3.9"
        tags                           = {}
        # (20 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.create_role will be updated in-place
  ~ resource "aws_lambda_function" "create_role" {
        id                             = "aft-account-provisioning-framework-create-aft-execution-role"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-9-1:1",
        ] -> (known after apply)
      ~ runtime                        = "python3.8" -> "python3.9"
        tags                           = {}
        # (20 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.persist_metadata will be updated in-place
  ~ resource "aws_lambda_function" "persist_metadata" {
        id                             = "aft-account-provisioning-framework-persist-metadata"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-9-1:1",
        ] -> (known after apply)
      ~ runtime                        = "python3.8" -> "python3.9"
        tags                           = {}
        # (20 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.tag_account will be updated in-place
  ~ resource "aws_lambda_function" "tag_account" {
        id                             = "aft-account-provisioning-framework-tag-account"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-9-1:1",
        ] -> (known after apply)
      ~ runtime                        = "python3.8" -> "python3.9"
        tags                           = {}
        # (20 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_account_request_action_trigger will be updated in-place
  ~ resource "aws_lambda_function" "aft_account_request_action_trigger" {
        id                             = "aft-account-request-action-trigger"
      ~ last_modified                  = "2023-03-20T15:26:56.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-9-1:1",
        ] -> (known after apply)
      ~ runtime                        = "python3.8" -> "python3.9"
      ~ source_code_hash               = "LAgQ4I4TDK9giGazG6/mEcz7mmvKsDkbRX8njyXGBsw=" -> "Zh/4hQn493GhJ4wLdIIEuBnk4/F9XLhuT3ftyDf7lUY="
        tags                           = {}
        # (18 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_account_request_audit_trigger will be updated in-place
  ~ resource "aws_lambda_function" "aft_account_request_audit_trigger" {
        id                             = "aft-account-request-audit-trigger"
      ~ last_modified                  = "2023-03-20T15:26:31.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-9-1:1",
        ] -> (known after apply)
      ~ runtime                        = "python3.8" -> "python3.9"
      ~ source_code_hash               = "LAgQ4I4TDK9giGazG6/mEcz7mmvKsDkbRX8njyXGBsw=" -> "Zh/4hQn493GhJ4wLdIIEuBnk4/F9XLhuT3ftyDf7lUY="
        tags                           = {}
        # (18 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_account_request_processor will be updated in-place
  ~ resource "aws_lambda_function" "aft_account_request_processor" {
        id                             = "aft-account-request-processor"
      ~ last_modified                  = "2023-03-20T15:26:21.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-9-1:1",
        ] -> (known after apply)
      ~ runtime                        = "python3.8" -> "python3.9"
      ~ source_code_hash               = "LAgQ4I4TDK9giGazG6/mEcz7mmvKsDkbRX8njyXGBsw=" -> "Zh/4hQn493GhJ4wLdIIEuBnk4/F9XLhuT3ftyDf7lUY="
        tags                           = {}
        # (18 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_cleanup_resources will be updated in-place
  ~ resource "aws_lambda_function" "aft_cleanup_resources" {
        id                             = "aft-cleanup-resources"
      ~ last_modified                  = "2023-03-20T15:27:03.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-9-1:1",
        ] -> (known after apply)
      ~ runtime                        = "python3.8" -> "python3.9"
      ~ source_code_hash               = "LAgQ4I4TDK9giGazG6/mEcz7mmvKsDkbRX8njyXGBsw=" -> "Zh/4hQn493GhJ4wLdIIEuBnk4/F9XLhuT3ftyDf7lUY="
        tags                           = {}
        # (18 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_controltower_event_logger will be updated in-place
  ~ resource "aws_lambda_function" "aft_controltower_event_logger" {
        id                             = "aft-controltower-event-logger"
      ~ last_modified                  = "2023-03-20T15:26:48.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-9-1:1",
        ] -> (known after apply)
      ~ runtime                        = "python3.8" -> "python3.9"
      ~ source_code_hash               = "LAgQ4I4TDK9giGazG6/mEcz7mmvKsDkbRX8njyXGBsw=" -> "Zh/4hQn493GhJ4wLdIIEuBnk4/F9XLhuT3ftyDf7lUY="
        tags                           = {}
        # (18 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_invoke_aft_account_provisioning_framework will be updated in-place
  ~ resource "aws_lambda_function" "aft_invoke_aft_account_provisioning_framework" {
        id                             = "aft-invoke-aft-account-provisioning-framework"
      ~ last_modified                  = "2023-03-20T15:26:41.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-9-1:1",
        ] -> (known after apply)
      ~ runtime                        = "python3.8" -> "python3.9"
      ~ source_code_hash               = "LAgQ4I4TDK9giGazG6/mEcz7mmvKsDkbRX8njyXGBsw=" -> "Zh/4hQn493GhJ4wLdIIEuBnk4/F9XLhuT3ftyDf7lUY="
        tags                           = {}
        # (18 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_backend.aws_iam_policy.replication has moved to module.account_factory_for_terraform.module.aft_backend.aws_iam_policy.replication[0]
    resource "aws_iam_policy" "replication" {
        id        = "arn:aws:iam::137554749751:policy/aft-s3-terraform-backend-replication-policy"
        name      = "aft-s3-terraform-backend-replication-policy"
        tags      = {}
        # (5 unchanged attributes hidden)
    }

  # module.account_factory_for_terraform.module.aft_backend.aws_iam_role.replication has moved to module.account_factory_for_terraform.module.aft_backend.aws_iam_role.replication[0]
    resource "aws_iam_role" "replication" {
        id                    = "aft-s3-terraform-backend-replication"
        name                  = "aft-s3-terraform-backend-replication"
        tags                  = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.account_factory_for_terraform.module.aft_backend.aws_iam_role_policy_attachment.replication has moved to module.account_factory_for_terraform.module.aft_backend.aws_iam_role_policy_attachment.replication[0]
    resource "aws_iam_role_policy_attachment" "replication" {
        id         = "aft-s3-terraform-backend-replication-20220314181059558800000025"
        # (2 unchanged attributes hidden)
    }

  # module.account_factory_for_terraform.module.aft_backend.aws_kms_alias.encrypt-alias-secondary-region has moved to module.account_factory_for_terraform.module.aft_backend.aws_kms_alias.encrypt-alias-secondary-region[0]
    resource "aws_kms_alias" "encrypt-alias-secondary-region" {
        id             = "alias/aft-backend-137554749751-kms-key"
        name           = "alias/aft-backend-137554749751-kms-key"
        # (3 unchanged attributes hidden)
    }

  # module.account_factory_for_terraform.module.aft_backend.aws_kms_key.encrypt-secondary-region has moved to module.account_factory_for_terraform.module.aft_backend.aws_kms_key.encrypt-secondary-region[0]
    resource "aws_kms_key" "encrypt-secondary-region" {
        id                                 = "e383ce05-f398-4791-b398-bbf911994c5e"
        tags                               = {
            "Name" = "aft-backend-137554749751-secondary-region-kms-key"
        }
        # (12 unchanged attributes hidden)
    }

  # module.account_factory_for_terraform.module.aft_backend.aws_s3_bucket.secondary-backend-bucket has moved to module.account_factory_for_terraform.module.aft_backend.aws_s3_bucket.secondary-backend-bucket[0]
    resource "aws_s3_bucket" "secondary-backend-bucket" {
        id                          = "aft-backend-137554749751-secondary-region"
        tags                        = {
            "Name" = "aft-backend-137554749751-secondary-region"
        }
        # (11 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_backend.aws_s3_bucket_acl.primary-backend-bucket-acl will be destroyed
  # (because aws_s3_bucket_acl.primary-backend-bucket-acl is not in configuration)
  - resource "aws_s3_bucket_acl" "primary-backend-bucket-acl" {
      - acl    = "private" -> null
      - bucket = "aft-backend-137554749751-primary-region" -> null
      - id     = "aft-backend-137554749751-primary-region,private" -> null

      - access_control_policy {
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - id   = "4720967b366eab584b4cd9ec6e5121646c40dd46760e01ebbfae2b4307f5a23d" -> null
                  - type = "CanonicalUser" -> null
                }
            }

          - owner {
              - id = "4720967b366eab584b4cd9ec6e5121646c40dd46760e01ebbfae2b4307f5a23d" -> null
            }
        }
    }

  # module.account_factory_for_terraform.module.aft_backend.aws_s3_bucket_acl.secondary-backend-bucket-acl will be destroyed
  # (because aws_s3_bucket_acl.secondary-backend-bucket-acl is not in configuration)
  - resource "aws_s3_bucket_acl" "secondary-backend-bucket-acl" {
      - acl    = "private" -> null
      - bucket = "aft-backend-137554749751-secondary-region" -> null
      - id     = "aft-backend-137554749751-secondary-region,private" -> null

      - access_control_policy {
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - display_name = "aws-cloud-pb-ct+aft" -> null
                  - id           = "4720967b366eab584b4cd9ec6e5121646c40dd46760e01ebbfae2b4307f5a23d" -> null
                  - type         = "CanonicalUser" -> null
                }
            }

          - owner {
              - display_name = "aws-cloud-pb-ct+aft" -> null
              - id           = "4720967b366eab584b4cd9ec6e5121646c40dd46760e01ebbfae2b4307f5a23d" -> null
            }
        }
    }

  # module.account_factory_for_terraform.module.aft_backend.aws_s3_bucket_public_access_block.secondary-backend-bucket has moved to module.account_factory_for_terraform.module.aft_backend.aws_s3_bucket_public_access_block.secondary-backend-bucket[0]
    resource "aws_s3_bucket_public_access_block" "secondary-backend-bucket" {
        id                      = "aft-backend-137554749751-secondary-region"
        # (5 unchanged attributes hidden)
    }

  # module.account_factory_for_terraform.module.aft_backend.aws_s3_bucket_replication_configuration.primary-backend-bucket-replication has moved to module.account_factory_for_terraform.module.aft_backend.aws_s3_bucket_replication_configuration.primary-backend-bucket-replication[0]
    resource "aws_s3_bucket_replication_configuration" "primary-backend-bucket-replication" {
        id     = "aft-backend-137554749751-primary-region"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.account_factory_for_terraform.module.aft_backend.aws_s3_bucket_server_side_encryption_configuration.secondary-backend-bucket-encryption has moved to module.account_factory_for_terraform.module.aft_backend.aws_s3_bucket_server_side_encryption_configuration.secondary-backend-bucket-encryption[0]
    resource "aws_s3_bucket_server_side_encryption_configuration" "secondary-backend-bucket-encryption" {
        id     = "aft-backend-137554749751-secondary-region"
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.account_factory_for_terraform.module.aft_backend.aws_s3_bucket_versioning.secondary-backend-bucket-versioning has moved to module.account_factory_for_terraform.module.aft_backend.aws_s3_bucket_versioning.secondary-backend-bucket-versioning[0]
    resource "aws_s3_bucket_versioning" "secondary-backend-bucket-versioning" {
        id     = "aft-backend-137554749751-secondary-region"
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.account_factory_for_terraform.module.aft_code_repositories.aws_codebuild_project.account_provisioning_customizations_pipeline will be updated in-place
  ~ resource "aws_codebuild_project" "account_provisioning_customizations_pipeline" {
        id                     = "arn:aws:codebuild:ca-central-1:137554749751:project/ct-aft-account-provisioning-customizations"
        name                   = "ct-aft-account-provisioning-customizations"
        tags                   = {}
        # (10 unchanged attributes hidden)



      ~ environment {
          ~ image                       = "aws/codebuild/amazonlinux2-x86_64-standard:3.0" -> "aws/codebuild/amazonlinux2-x86_64-standard:4.0"
            # (4 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }



        # (5 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_code_repositories.aws_codebuild_project.account_request will be updated in-place
  ~ resource "aws_codebuild_project" "account_request" {
        id                     = "arn:aws:codebuild:ca-central-1:137554749751:project/ct-aft-account-request"
        name                   = "ct-aft-account-request"
        tags                   = {}
        # (10 unchanged attributes hidden)



      ~ environment {
          ~ image                       = "aws/codebuild/amazonlinux2-x86_64-standard:3.0" -> "aws/codebuild/amazonlinux2-x86_64-standard:4.0"
            # (4 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }



        # (5 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_customizations.aws_codebuild_project.aft_account_customizations_terraform will be updated in-place
  ~ resource "aws_codebuild_project" "aft_account_customizations_terraform" {
        id                     = "arn:aws:codebuild:ca-central-1:137554749751:project/aft-account-customizations-terraform"
        name                   = "aft-account-customizations-terraform"
        tags                   = {}
        # (10 unchanged attributes hidden)



      ~ environment {
          ~ image                       = "aws/codebuild/amazonlinux2-x86_64-standard:3.0" -> "aws/codebuild/amazonlinux2-x86_64-standard:4.0"
            # (4 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }



        # (5 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_customizations.aws_codebuild_project.aft_create_pipeline will be updated in-place
  ~ resource "aws_codebuild_project" "aft_create_pipeline" {
        id                     = "arn:aws:codebuild:ca-central-1:137554749751:project/aft-create-pipeline"
        name                   = "aft-create-pipeline"
        tags                   = {}
        # (10 unchanged attributes hidden)



      ~ environment {
          ~ image                       = "aws/codebuild/amazonlinux2-x86_64-standard:3.0" -> "aws/codebuild/amazonlinux2-x86_64-standard:4.0"
            # (4 unchanged attributes hidden)

            # (9 unchanged blocks hidden)
        }



        # (5 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_customizations.aws_codebuild_project.aft_global_customizations_terraform will be updated in-place
  ~ resource "aws_codebuild_project" "aft_global_customizations_terraform" {
        id                     = "arn:aws:codebuild:ca-central-1:137554749751:project/aft-global-customizations-terraform"
        name                   = "aft-global-customizations-terraform"
        tags                   = {}
        # (10 unchanged attributes hidden)



      ~ environment {
          ~ image                       = "aws/codebuild/amazonlinux2-x86_64-standard:3.0" -> "aws/codebuild/amazonlinux2-x86_64-standard:4.0"
            # (4 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }



        # (5 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_customizations.aws_lambda_function.aft_customizations_execute_pipeline will be updated in-place
  ~ resource "aws_lambda_function" "aft_customizations_execute_pipeline" {
        id                             = "aft-customizations-execute-pipeline"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-9-1:1",
        ] -> (known after apply)
      ~ runtime                        = "python3.8" -> "python3.9"
        tags                           = {}
        # (20 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_customizations.aws_lambda_function.aft_customizations_get_pipeline_executions will be updated in-place
  ~ resource "aws_lambda_function" "aft_customizations_get_pipeline_executions" {
        id                             = "aft-customizations-get-pipeline-executions"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-9-1:1",
        ] -> (known after apply)
      ~ runtime                        = "python3.8" -> "python3.9"
        tags                           = {}
        # (20 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_customizations.aws_lambda_function.aft_customizations_identify_targets will be updated in-place
  ~ resource "aws_lambda_function" "aft_customizations_identify_targets" {
        id                             = "aft-customizations-identify-targets"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-9-1:1",
        ] -> (known after apply)
      ~ runtime                        = "python3.8" -> "python3.9"
        tags                           = {}
        # (20 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_customizations.aws_s3_bucket_acl.aft-codepipeline-customizations-bucket-acl will be destroyed
  # (because aws_s3_bucket_acl.aft-codepipeline-customizations-bucket-acl is not in configuration)
  - resource "aws_s3_bucket_acl" "aft-codepipeline-customizations-bucket-acl" {
      - acl    = "private" -> null
      - bucket = "aft-customizations-pipeline-137554749751" -> null
      - id     = "aft-customizations-pipeline-137554749751,private" -> null

      - access_control_policy {
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - id   = "4720967b366eab584b4cd9ec6e5121646c40dd46760e01ebbfae2b4307f5a23d" -> null
                  - type = "CanonicalUser" -> null
                }
            }

          - owner {
              - id = "4720967b366eab584b4cd9ec6e5121646c40dd46760e01ebbfae2b4307f5a23d" -> null
            }
        }
    }

  # module.account_factory_for_terraform.module.aft_feature_options.aws_lambda_function.aft_delete_default_vpc will be updated in-place
  ~ resource "aws_lambda_function" "aft_delete_default_vpc" {
        id                             = "aft-delete-default-vpc"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-9-1:1",
        ] -> (known after apply)
      ~ runtime                        = "python3.8" -> "python3.9"
        tags                           = {}
        # (20 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_feature_options.aws_lambda_function.aft_enable_cloudtrail will be updated in-place
  ~ resource "aws_lambda_function" "aft_enable_cloudtrail" {
        id                             = "aft-enable-cloudtrail"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-9-1:1",
        ] -> (known after apply)
      ~ runtime                        = "python3.8" -> "python3.9"
        tags                           = {}
        # (20 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_feature_options.aws_lambda_function.aft_enroll_support will be updated in-place
  ~ resource "aws_lambda_function" "aft_enroll_support" {
        id                             = "aft-enroll-support"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-9-1:1",
        ] -> (known after apply)
      ~ runtime                        = "python3.8" -> "python3.9"
        tags                           = {}
        # (20 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_feature_options.aws_s3_bucket_acl.aft_access_logs_acl will be destroyed
  # (because aws_s3_bucket_acl.aft_access_logs_acl is not in configuration)
  - resource "aws_s3_bucket_acl" "aft_access_logs_acl" {
      - acl    = "log-delivery-write" -> null
      - bucket = "aws-aft-s3-access-logs-274536870005-ca-central-1" -> null
      - id     = "aws-aft-s3-access-logs-274536870005-ca-central-1,log-delivery-write" -> null

      - access_control_policy {
          - grant {
              - permission = "READ_ACP" -> null

              - grantee {
                  - type = "Group" -> null
                  - uri  = "http://acs.amazonaws.com/groups/s3/LogDelivery" -> null
                }
            }
          - grant {
              - permission = "WRITE" -> null

              - grantee {
                  - type = "Group" -> null
                  - uri  = "http://acs.amazonaws.com/groups/s3/LogDelivery" -> null
                }
            }
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - id   = "5c6364e5c087ae242ef84403ecc5d4959ebc70a65b03ed7afef809e37403d606" -> null
                  - type = "CanonicalUser" -> null
                }
            }

          - owner {
              - id = "5c6364e5c087ae242ef84403ecc5d4959ebc70a65b03ed7afef809e37403d606" -> null
            }
        }
    }

  # module.account_factory_for_terraform.module.aft_feature_options.aws_s3_bucket_policy.aft_access_logs will be created
  + resource "aws_s3_bucket_policy" "aft_access_logs" {
      + bucket = "aws-aft-s3-access-logs-274536870005-ca-central-1"
      + id     = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:PutObject"
                      + Condition = {
                          + ArnLike      = {
                              + aws:SourceArn = "arn:aws:s3:::aws-aft-logs-274536870005-ca-central-1"
                            }
                          + StringEquals = {
                              + aws:SourceAccount = "274536870005"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "logging.s3.amazonaws.com",
                            ]
                        }
                      + Resource  = [
                          + "arn:aws:s3:::aws-aft-s3-access-logs-274536870005-ca-central-1/*",
                        ]
                      + Sid       = "Allow PutObject"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.account_factory_for_terraform.module.aft_lambda_layer.data.aws_lambda_invocation.invoke_codebuild_job will be read during apply
  # (config refers to values not yet known)
 <= data "aws_lambda_invocation" "invoke_codebuild_job"  {
      ~ id            = "aft-lambda-layer-codebuild-invoker_$LATEST_85ecff383c221a8fb66cb664769de181" -> (known after apply)
      - qualifier     = "$LATEST" -> null
      ~ result        = jsonencode(
            {
              - Status = 200
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.account_factory_for_terraform.module.aft_lambda_layer.aws_codebuild_project.codebuild will be updated in-place
  ~ resource "aws_codebuild_project" "codebuild" {
        id                     = "arn:aws:codebuild:ca-central-1:137554749751:project/python-layer-builder-aft-common-7t3pnvob"
        name                   = "python-layer-builder-aft-common-7t3pnvob"
        tags                   = {}
        # (10 unchanged attributes hidden)



      ~ environment {
          ~ image                       = "aws/codebuild/amazonlinux2-x86_64-standard:3.0" -> "aws/codebuild/amazonlinux2-x86_64-standard:4.0"
            # (4 unchanged attributes hidden)

          ~ environment_variable {
                name  = "PYTHON_VERSION"
              ~ value = "3.8" -> "3.9"
                # (1 unchanged attribute hidden)
            }
          ~ environment_variable {
                name  = "EVENT_RULE_NAME"
              ~ value = "python-layer-builder-aft-common-7t3pnvob-1-9-1" -> "python-layer-builder-aft-common-7t3pnvob-1-10-3"
                # (1 unchanged attribute hidden)
            }
            # (6 unchanged blocks hidden)
        }



        # (5 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_lambda_layer.aws_lambda_function.codebuild_invoker will be updated in-place
  ~ resource "aws_lambda_function" "codebuild_invoker" {
        id                             = "aft-lambda-layer-codebuild-invoker"
      ~ runtime                        = "python3.8" -> "python3.9"
        tags                           = {}
        # (21 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_lambda_layer.aws_lambda_layer_version.layer_version must be replaced
+/- resource "aws_lambda_layer_version" "layer_version" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-9-1:1" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ compatible_runtimes         = [ # forces replacement
          - "python3.8",
          + "python3.9",
        ]
      ~ created_date                = "2023-03-20T15:26:11.079+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-9-1:1" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-9-1" -> (known after apply)
      ~ layer_name                  = "aft-common-1-9-1" -> "aft-common-1-10-3" # forces replacement
      + signing_job_arn       ...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_cloudwatch_log_group.account_metadata_ssm"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_cloudwatch_log_group.create_role"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_cloudwatch_log_group.persist_metadata"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_cloudwatch_log_group.tag_account"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role.aft_lambda_aft_account_provisioning_framework_create_role"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role.aft_lambda_aft_account_provisioning_framework_persist_metadata"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role.aft_lambda_aft_account_provisioning_framework_tag_account"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role.aft_states"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.account_metadata_ssm"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.create_role"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.persist_metadata"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
